In [2]:
import pandas as pd

In [3]:
my_Series = pd.Series([1, 'cat', 10.2, 'dog'])
my_Series

0       1
1     cat
2    10.2
3     dog
dtype: object

In [4]:
my_Series[1]

'cat'

In [5]:
ages = pd.Series([20,53,68], index = ['John', 'Allen', 'Mary'])
ages

John     20
Allen    53
Mary     68
dtype: int64

In [6]:
ages['Mary']

68

In [8]:
df = pd.DataFrame({'user' : [1,2,3],
             'age' : [24,54,17],
             'sex' : ['F', 'F', 'M'],
             'occupation' : ['technician', 'musician', 'student']})
df

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [12]:
#df.set_index('user', inplace = True)
df

      age sex  occupation
user
1      24   F  technician
2      54   F    musician
3      17   M     student

In [13]:
df.head()

      age sex  occupation
user
1      24   F  technician
2      54   F    musician
3      17   M     student

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 3 columns):
age           3 non-null int64
sex           3 non-null object
occupation    3 non-null object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [15]:
df.index

Int64Index([1, 2, 3], dtype='int64', name='user')

In [17]:
df.shape[0]

3

In [18]:
df.shape[1]

3

In [21]:
df.columns

Index(['age', 'sex', 'occupation'], dtype='object')

In [22]:
df.dtypes

age            int64
sex           object
occupation    object
dtype: object

In [23]:
df.describe()

             age
count   3.000000
mean   31.666667
std    19.655364
min    17.000000
25%    20.500000
50%    24.000000
75%    39.000000
max    54.000000

In [24]:
df['occupation']

user
1    technician
2      musician
3       student
Name: occupation, dtype: object